Public Types | Public Member Functions | Friends | List of all members
ACAPI::DesignOptions::HotlinkDesignOptionTable Class Reference
Design Options
A class that represents the design option structure of a hotlink or node. More...
#include <HotlinkDesignOptionTable.hpp>
 Inheritance diagram for ACAPI::DesignOptions::HotlinkDesignOptionTable:
 Public Types
enum class  | FilterMode { MainModelOnly = 0 , FilterByOptions = 1 , FilterByCombination = 2 }
The mode how the hotlink instance's elements are filtered by Design Options. Only the filtered elements are visible.
 Public Member Functions
const GS::Guid  | GetNodeGuid () const
std::vector< GS::UniString >  | GetCombinationsNames () const
std::vector< GS::UniString >  | GetSetsNames () const
std::vector< GS::UniString >  | GetOptionsNamesOfSet (const GS::UniString &setName) const
std::optional< GS::UniString >  | GetActiveCombination () const
std::optional< GS::UniString >  | GetActiveOptionInSet (const GS::UniString &setName) const
FilterMode  | GetFilterMode () const
ACAPI::Result< void >  | ActivateCombination (const GS::UniString &combinationName)
Activates the given combination.
ACAPI::Result< void >  | ActivateOptionInSet (const GS::UniString &setName, const GS::UniString &optionName)
Activates an option in a set and deactivates the previous active option.
ACAPI::Result< void >  | DeactivateOptionsInSet (const GS::UniString &setName)
Deactivates the active option if it existed.
 void  | DeactivateCombination ()
Deactivates the active combination if it existed.
void  | SetFilterMode (FilterMode filterMode)
Sets the Design Option filtering mode of the Hotlink.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | DesignOptionManager
 class  | Impl::DesignOptionManagerImpl
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that represents the design option structure of a hotlink or node.
Since
Archicad 29
Member Function Documentation
◆ ActivateCombination()
 ACAPI::Result< void > ACAPI::DesignOptions::HotlinkDesignOptionTable::ActivateCombination  |  ( |  const GS::UniString & |  combinationName | )
Activates the given combination.
Returns
An error if the given combination is missing, otherwise nothing.
Parameters
combinationName | Name of the combination that will be activated.
◆ ActivateOptionInSet()
 ACAPI::Result< void > ACAPI::DesignOptions::HotlinkDesignOptionTable::ActivateOptionInSet  |  ( |  const GS::UniString & |  setName,
|  const GS::UniString & |  optionName )
Activates an option in a set and deactivates the previous active option.
Returns
An error if the given set or option is missing, otherwise nothing.
Parameters
setName | The name of the set in which the option will be activated.
optionName | The name of the option that will be activated.
◆ DeactivateOptionsInSet()
 ACAPI::Result< void > ACAPI::DesignOptions::HotlinkDesignOptionTable::DeactivateOptionsInSet  |  ( |  const GS::UniString & |  setName | )
Deactivates the active option if it existed.
Returns
An error if the given set is missing, otherwise nothing.
Parameters
setName | The name of the set in which the option will be deactivated.
◆ GetActiveCombination()
 std::optional< GS::UniString > ACAPI::DesignOptions::HotlinkDesignOptionTable::GetActiveCombination  |  ( |   | ) |   const
Returns
The name of the active combination.
◆ GetActiveOptionInSet()
 std::optional< GS::UniString > ACAPI::DesignOptions::HotlinkDesignOptionTable::GetActiveOptionInSet  |  ( |  const GS::UniString & |  setName | ) |   const
Returns
The name of the active option in set.
Parameters
setName | The name of the set whose active option will be returned.
◆ GetCombinationsNames()
 std::vector< GS::UniString > ACAPI::DesignOptions::HotlinkDesignOptionTable::GetCombinationsNames  |  ( |   | ) |   const
Returns
The names of the design option combinations from a hotlink.
◆ GetFilterMode()
 FilterMode ACAPI::DesignOptions::HotlinkDesignOptionTable::GetFilterMode  |  ( |   | ) |   const
Returns
The Design Option filtering mode.
◆ GetNodeGuid()
 const GS::Guid ACAPI::DesignOptions::HotlinkDesignOptionTable::GetNodeGuid  |  ( |   | ) |   const
Returns
The guid of the hotlink node which belongs to this design option table.
◆ GetOptionsNamesOfSet()
 std::vector< GS::UniString > ACAPI::DesignOptions::HotlinkDesignOptionTable::GetOptionsNamesOfSet  |  ( |  const GS::UniString & |  setName | ) |   const
Returns
The list of names of the design options in a given set from hotlink.
Parameters
setName | The name of the set whose options are requested.
◆ GetSetsNames()
 std::vector< GS::UniString > ACAPI::DesignOptions::HotlinkDesignOptionTable::GetSetsNames  |  ( |   | ) |   const
Returns
The names of the design option sets from a hotlink.
◆ SetFilterMode()
 void ACAPI::DesignOptions::HotlinkDesignOptionTable::SetFilterMode  |  ( |  FilterMode |  filterMode | )
Sets the Design Option filtering mode of the Hotlink.
Parameters
filterMode | The new filter mode to be set.